core/app/models/user.rb

    def activate
        self.update_attribute(:activated, true)
---
UPDATE `users` SET `users`.`updated_at` = '2025-03-22 07:23:42.444653', `users`.`remember_digest` = NULL WHERE `users`.`id` = 13