core/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('foobar', 'sugu011sd40114@gmail.com', '2025-03-18 10:30:21.387337', '2025-03-18 10:30:21.387337', '$2a$12$M9szGsntrv8hRf/eFqmneOnkQysEZOV1HHF9Z.24KB.pAsCWcAUXS')