core/app/helpers/sessions_helper.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 13 LIMIT 1
---
    def current_user
        if (user_id = session[:user_id])
            @current_user ||= User.find_by(id: user_id)
        elsif (user_id = cookies.encrypted[:user_id])
            user = User.find_by(id: user_id)